DSU/src/Documents/ПлановыеДоходыРасходы/ПлановыеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлановыеДоходыРасходы</name>
  <registerRecords>InformationRegister.ГрафикПлановыхДоходовРасходов</registerRecords>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидДвиженияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

DSU/src/InformationRegisters/ГрафикПлановыхДоходовРасходов/ГрафикПлановыхДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикПлановыхДоходовРасходов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидДвиженияДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DSU/src/Documents/ПлановыеДоходыРасходы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПериодПланирования = 0 Тогда
		ПредставлениеПериода = Формат(ДатаПланирования, "ДФ='d MMMM yyyy'");
	ИначеЕсли ПериодПланирования = 1 Тогда
		ПредставлениеПериода = Строка(НомерДня) + "-й день недели";
	ИначеЕсли ПериодПланирования = 2 Тогда
		ПредставлениеПериода = Строка(НомерДня) + "-е число месяца";
	ИначеЕсли ПериодПланирования = 3 Тогда
		ПредставлениеПериода = Формат(ДатаПланирования, "ДФ='d MMMM'");;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем локДатаНачала, локДатаОкончания;
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		локДатаНачала = ДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(Дата) Тогда
		локДатаНачала = НачалоДня(Дата);
	Иначе
		локДатаНачала = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		локДатаОкончания = ДатаОкончания;
	Иначе
		локДатаОкончания = НачалоДня(ДобавитьМесяц(ТекущаяДата(), 600));
	КонецЕсли;
	
	Движения.ГрафикПлановыхДоходовРасходов.Очистить();
	Движения.ГрафикПлановыхДоходовРасходов.Записывать = Истина;
	
	Если ПериодПланирования = 0 Тогда  // однократно (один день)
		
		НоваяСтрока = Движения.ГрафикПлановыхДоходовРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, "ВидДвижения,Статья,Сумма,Комментарий");
		НоваяСтрока.Период = ДатаПланирования;
		
	ИначеЕсли ПериодПланирования = 1 Тогда	// неделя
		
		СтартоваяДата = НачалоНедели(локДатаНачала) + НомерДня*86400;
		
		Если СтартоваяДата < локДатаНачала Тогда
			ДатаГрафика = СтартоваяДата + 7*86400;
		Иначе
			ДатаГрафика = СтартоваяДата;
		КонецЕсли;
		
		Пока ДатаГрафика <= локДатаОкончания Цикл
			
			НоваяСтрока = Движения.ГрафикПлановыхДоходовРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, "ВидДвижения,Статья,Сумма,Комментарий");
			НоваяСтрока.Период = ДатаГрафика;
			ДатаГрафика = ДатаГрафика + 7*86400;
			
		КонецЦикла;	
				
	ИначеЕсли ПериодПланирования = 2 Тогда // ежемесячно
		
		НачалоМесяца = Дата(Год(локДатаНачала), Месяц(локДатаНачала), 1);
		КрайнийДеньМесяца = День(КонецМесяца(НачалоМесяца));
		
		Если КрайнийДеньМесяца < НомерДня Тогда
			СтартоваяДата = НачалоДня(КонецМесяца(НачалоМесяца));
		Иначе
			СтартоваяДата = Дата(Год(НачалоМесяца), Месяц(НачалоМесяца), НомерДня);
		КонецЕсли;
		
		Если СтартоваяДата < локДатаНачала Тогда
			НачалоМесяца = ДобавитьМесяц(НачалоМесяца, 1);
			ДатаГрафика = Дата(Год(НачалоМесяца), Месяц(НачалоМесяца), НомерДня);
		Иначе
			ДатаГрафика = СтартоваяДата;
		КонецЕсли;
		
		Пока ДатаГрафика <= локДатаОкончания Цикл
			
			НоваяСтрока = Движения.ГрафикПлановыхДоходовРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, "ВидДвижения,Статья,Сумма,Комментарий");
			НоваяСтрока.Период = ДатаГрафика;
			
			НачалоМесяца = ДобавитьМесяц(НачалоМесяца, 1);
			КрайнийДеньМесяца = День(КонецМесяца(НачалоМесяца));
			
			Если КрайнийДеньМесяца < НомерДня Тогда
				ДатаГрафика = НачалоДня(КонецМесяца(НачалоМесяца));
			Иначе
				ДатаГрафика = Дата(Год(НачалоМесяца), Месяц(НачалоМесяца), НомерДня);
			КонецЕсли;	
			
		КонецЦикла;	
		
	ИначеЕсли ПериодПланирования = 3 Тогда // ежегодно
		
		СтартоваяДата = Дата(Год(локДатаНачала), Месяц(ДатаПланирования), День(ДатаПланирования));
		
		Если СтартоваяДата < локДатаНачала Тогда
			ДатаГрафика = ДобавитьМесяц(СтартоваяДата, 12);
		Иначе
			ДатаГрафика = СтартоваяДата;
		КонецЕсли;
		
		Пока ДатаГрафика <= локДатаОкончания Цикл
			
			НоваяСтрока = Движения.ГрафикПлановыхДоходовРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект, "ВидДвижения,Статья,Сумма,Комментарий");
			НоваяСтрока.Период = ДатаГрафика;
			ДатаГрафика = ДобавитьМесяц(ДатаГрафика, 12);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПериодПланирования = 1 И НомерДня > 7 Тогда
		Сообщить("Неправильно указан номер дня недели!");
		Отказ = Истина;
	ИначеЕсли ПериодПланирования = 2 И НомерДня > 31 Тогда
		Сообщить("Неправильно указано число месяца!");
		Отказ = Истина;
	КонецЕсли;		
	
КонецПроцедуры
